// Copyright (c) [2024] [Jovan J. E. Odassius]
//
// License: MIT (See the LICENSE file in the root directory)
// Github: https://github.com/untyper/process-memory-module

// TODO:
// - Add EPROCESS offsets for Winwodws 11.
// - Add method to attach by process name. For stealth purposes, the process should be acquired by enumerating the process list in EPROCESS.
// - Add method to change page protection e.g. set_page_protection(address, PAGE_READWRITE_EXECUTE)
// - Add pattern scanner (IDA style and C byte array style)
// - Adjust comments from snake_case to PascalCase
// - Test PE header and section extraction, see if theyre returned properly
// - Add method to retrieve version from process, either from PE header or EPROCESS.

#ifndef PMM_PROCESS_MEMORY_MODULE_H
#define PMM_PROCESS_MEMORY_MODULE_H

#include <hv.h>

#include <iostream>
#include <psapi.h>
#include <thread>
#include <chrono>
#include <string>
#include <unordered_map>
#include <vector>
#include <array>
#include <cstdint>
#include <functional>
#include <algorithm>
#include <optional>

#include <Windows.h>

namespace pmm
{

  enum class Error
  {
    Error, // Generic error

    // TODO: Define more error codes
  };

  template<typename T = bool>
  class Result
  {
  private:
    T Value = {};
    Error ErrorValue = {};
    bool HasValue = false;

  public:
    // Constructors
    inline static Result Success(const T& Val)
    {
      return { Val, Error{}, true };
    }

    inline static Result Failure(const Error& ErrorValue)
    {
      return { T{}, ErrorValue, false };
    }

    inline explicit operator bool() const
    {
      return this->HasValue;
    }

    inline bool operator!() const
    {
      return !this->HasValue;
    }

    // Value access — only valid if (result)
    inline const T& operator*() const
    {
      return this->Value;
    }

    inline const T* operator->() const
    {
      return &this->Value;
    }

    inline const T& GetValue() const
    {
      return this->Value;
    }

    inline const Error& GetError() const
    {
      return this->ErrorValue;
    }

    Result(const T& Value) :
      Value(Value), HasValue(true)
    {
    }

    Result(const Error& ErrorValue) :
      ErrorValue(ErrorValue)
    {
    }

    Result(const T& Value, const Error& ErrorValue, bool HasValue) :
      Value(Value), ErrorValue(ErrorValue), HasValue(HasValue)
    {
    }
  };

  class Process;

  namespace OsVersion
  {

    // Windows (10/11) versions represented by their respective build numbers.
    // These are required for our EPROCESS offsets. There could be a more dynamic way of retrieving the offsets,
    // (e.g. directly parsing kernel pdb or maybe even pattern matching) but for now this works just fine for the intended use case.
    enum : std::uint64_t
    {
      Windows_10_1507                  = 10240,
      Windows_10_1511                  = 10586,
      Windows_10_1607                  = 14393,
      Windows_10_1703                  = 15063,
      Windows_10_1709                  = 16299,
      Windows_10_1803                  = 17134,
      Windows_10_1809                  = 17763,
      Windows_10_1903                  = 18362,
      Windows_10_1909                  = 18363,
      Windows_10_2004                  = 19041,
      Windows_10_20h2                  = 19042,
      Windows_10_21h1                  = 19043,
      Windows_10_21h2                  = 19044,
      Windows_10_22h2                  = 19045
    };

  } // namespace OsVersion

  // Internal use only (detail).
  class pmm_
  {
  protected:
    // Struct representing a page table entry (PTE)
    // Declarations: PTE
    struct PTE
    {
      ULONGLONG                        Valid : 1;
      ULONGLONG                        Write : 1;
      ULONGLONG                        Owner : 1;
      ULONGLONG                        WriteThrough : 1;
      ULONGLONG                        CacheDisable : 1;
      ULONGLONG                        Accessed : 1;
      ULONGLONG                        Dirty : 1;
      ULONGLONG                        LargePage : 1;
      ULONGLONG                        Global : 1;
      ULONGLONG                        CopyOnWrite : 1;
      ULONGLONG                        Prototype : 1;
      ULONGLONG                        Reserved0 : 1;
      ULONGLONG                        PageFrameNumber : 40;
      ULONGLONG                        SoftwareWsIndex : 11;
      ULONGLONG                        NoExecute : 1;
    };

    // Declarations: MMVAD_SHORT, MMVAD_FLAGS, MMVAD_FLAGS1

    // Applicable to:
    // - Windows 10 (1507, 1511, 1607, 1703, 1709)
    struct MMVAD_FLAGS_1507
    {
      ULONG                            Padding1 : 3;       //0x0
      ULONG                            Protection : 5;     //0x0
      ULONG                            Padding2 : 7;       //0x0
      ULONG                            PrivateMemory : 1;  //0x0
    };

    // Applicable to:
    // - Windows 10 (1803, 1809)
    struct MMVAD_FLAGS_1803
    {
      ULONG                            Padding1 : 3;       //0x0
      ULONG                            Protection : 5;     //0x0
      ULONG                            Padding2 : 6;       //0x0
      ULONG                            PrivateMemory : 1;  //0x0
    };

    // Applicable to:
    // - Windows 10 (1903, 1909, 2004, 20H2, 21H1, 21H2, 22H2)
    struct MMVAD_FLAGS_1903
    {
      ULONG                            Padding1 : 7;       //0x0
      ULONG                            Protection : 5;     //0x0
      ULONG                            Padding2 : 6;       //0x0
      ULONG                            PageSize : 2;       //0x0
      ULONG                            PrivateMemory : 1;  //0x0
    };

    // Applicable to:
    // - All versions of windows 10/11 as of 2024.
    struct MMVAD_Flags1
    {
      ULONG                            Padding1 : 31;      //0x0
      ULONG                            MemCommit : 1;      //0x0
    };

    // Applicable to:
    // - All versions of windows 10/11 as of 2024.
    struct MMVAD_SHORT
    {
      // These pointers are used to store addresses from an external program.
      // Not for internal use.
      MMVAD_SHORT*                     LeftChild;          //0x0
      MMVAD_SHORT*                     RightChild;         //0x8
      ULONGLONG                        Parent;             //0x10
      ULONG                            StartingVpn;        //0x18
      ULONG                            EndingVpn;          //0x1c
      UCHAR                            StartingVpnHigh;    //0x20
      UCHAR                            EndingVpnHigh;      //0x21
      BYTE                             Padding[8];         //0x22
      //MMVAD_FLAGS                    vad_flags;          //0x30
      //MMVAD_FLAGS1                   vad_flags1;         //0x34
    };

    struct MMVAD_SHORT_1507 : MMVAD_SHORT
    {
      MMVAD_FLAGS_1507                 VadFlags;           //0x30
      MMVAD_Flags1                     VadFlags1;          //0x34
    };

    struct MMVAD_SHORT_1803 : MMVAD_SHORT
    {
      MMVAD_FLAGS_1803                 VadFlags;           //0x30
      MMVAD_Flags1                     VadFlags1;          //0x34
    };

    struct MMVAD_SHORT_1903 : MMVAD_SHORT
    {
      MMVAD_FLAGS_1903                 VadFlags;           //0x30
      MMVAD_Flags1                     VadFlags1;          //0x34
    };

    // Declarations: EPROCESSOffsets
    struct EPROCESSOffsets
    {
      std::uint64_t                    ActiveProcessLinks  = 0x00;
      std::uint64_t                    UniqueProcessId     = 0x00;
      std::uint64_t                    ImageFileName       = 0x00;
      std::uint64_t                    SectionBaseAddress  = 0x00;
      std::uint64_t                    VadRoot             = 0x00;
      std::uint64_t                    ExitStatus          = 0x00;
    };

    // The default IA32_PAT register value defined by the Intel manual.
    // Translates to:
    // 
    //  PA[0] = 0x06 (Write Back)
    //  PA[1] = 0x04 (Write Through)
    //  PA[2] = 0x07 (Uncacheable Minus)
    //  PA[3] = 0x00 (Uncacheable)
    //  PA[4] = 0x06 (Write Back)
    //  PA[5] = 0x04 (Write Through)
    //  PA[6] = 0x07 (Uncacheable Minus)
    //  PA[7] = 0x00 (Uncacheable)
    //
